<?php

return [
  'confirmed' => 'Пароли не совпадают.',
  'min' => [
    'string' => 'Поле :attribute должно быть не менее :min символов.',
  ],
  'password' => [
    'letters' => 'Поле :attribute должно содержать хотя бы одну букву.',
    'mixed'   => 'Поле :attribute должно содержать хотя бы одну заглавную и одну строчную букву.',
    'numbers' => 'Поле :attribute должно содержать хотя бы одно число.',
    'symbols' => 'Поле :attribute должно содержать хотя бы один спецсимвол.',
    'uncompromised' => 'Выбранный :attribute засветился в утечках данных. Выберите другой.',
  ],
  'attributes' => [
    'password' => 'пароль',
    'email' => 'email адрес',
  ],
];
